hananddong/ble_uwb_code/UWB_BLE_nrf52832/modules/nrfx/hal/nrf_saadc.h
    @param[in] saadc_task SAADC task.
*/
__STATIC_INLINE void nrf_saadc_task_trigger(nrf_saadc_task_t saadc_task)
{
    *((volatile uint32_t *)((uint8_t *)NRF_SAADC + (uint32_t)saadc_task)) = 0x1UL;
}


/**
    @brief Function for getting the address of a specific SAADC task register.

    @param[in] saadc_task SAADC task.

    @return Address of the specified SAADC task.
*/
__STATIC_INLINE uint32_t nrf_saadc_task_address_get(nrf_saadc_task_t saadc_task)
{
    return (uint32_t)((uint8_t *)NRF_SAADC + (uint32_t)saadc_task);
}


/**
    @brief Function for getting the state of a specific SAADC event.

    @param[in] saadc_event SAADC event.

    @return State of the specified SAADC event.
*/
__STATIC_INLINE bool nrf_saadc_event_check(nrf_saadc_event_t saadc_event)
{
    return (bool) * (volatile uint32_t *)((uint8_t *)NRF_SAADC + (uint32_t)saadc_event);
}


/**
    @brief Function for clearing the specific SAADC event.

    @param[in] saadc_event SAADC event.
*/
__STATIC_INLINE void nrf_saadc_event_clear(nrf_saadc_event_t saadc_event)
{
    *((volatile uint32_t *)((uint8_t *)NRF_SAADC + (uint32_t)saadc_event)) = 0x0UL;
    #if __CORTEX_M == 0x04
    volatile uint32_t dummy = *((volatile uint32_t *)((uint8_t *)NRF_SAADC + (uint32_t)saadc_event));
    (void)dummy;
    #endif
}


/**
    @brief Function for getting the address of a specific SAADC event register.

    @param[in] saadc_event SAADC event.

    @return Address of the specified SAADC event.
*/
__STATIC_INLINE uint32_t  nrf_saadc_event_address_get(nrf_saadc_event_t saadc_event)
{
    return (uint32_t)((uint8_t *)NRF_SAADC + (uint32_t)saadc_event);
}


/**
    @brief Function for getting the address of a specific SAADC limit event register.

    @param[in] channel Channel number.
    @param[in] limit_type Low limit or high limit.

    @return Address of the specified SAADC limit event.
*/
__STATIC_INLINE volatile uint32_t *nrf_saadc_event_limit_address_get(uint8_t channel, nrf_saadc_limit_t limit_type)
{
    NRFX_ASSERT(channel < NRF_SAADC_CHANNEL_COUNT);
    
    if(limit_type == NRF_SAADC_LIMIT_HIGH)
        return &NRF_SAADC->EVENTS_CH[channel].LIMITH;
        
    else
        return &NRF_SAADC->EVENTS_CH[channel].LIMITL;
}


/**
    @brief Function for getting the SAADC channel monitoring limit events.

    @param[in] channel    Channel number.
    @param[in] limit_type Low limit or high limit.
*/
__STATIC_INLINE nrf_saadc_event_t nrf_saadc_event_limit_get(uint8_t channel, nrf_saadc_limit_t limit_type)
{
    if(limit_type == NRF_SAADC_LIMIT_HIGH)
    {
        return (nrf_saadc_event_t)((uint32_t) NRF_SAADC_EVENT_CH0_LIMITH +
                                   (uint32_t)(NRF_SAADC_EVENT_CH1_LIMITH - NRF_SAADC_EVENT_CH0_LIMITH)
                                   * (uint32_t) channel);
    }
    
    else
    {
        return (nrf_saadc_event_t)((uint32_t) NRF_SAADC_EVENT_CH0_LIMITL +
                                   (uint32_t)(NRF_SAADC_EVENT_CH1_LIMITL - NRF_SAADC_EVENT_CH0_LIMITL)
                                   * (uint32_t) channel);
    }
}


/**
    @brief Function for configuring the input pins for a specific SAADC channel.

    @param[in] channel Channel number.
    @param[in] pselp   Positive input.
    @param[in] pseln   Negative input. Set to NRF_SAADC_INPUT_DISABLED in single ended mode.
*/
__STATIC_INLINE void nrf_saadc_channel_input_set(uint8_t channel,
                                                 nrf_saadc_input_t pselp,
                                                 nrf_saadc_input_t pseln)
{
    NRF_SAADC->CH[channel].PSELN = pseln;
    NRF_SAADC->CH[channel].PSELP = pselp;
}


/**
    @brief Function for configuring the positive input pin for a specific SAADC channel.

    @param[in] channel Channel number.
    @param[in] pselp   Positive input.
*/
__STATIC_INLINE void nrf_saadc_channel_pos_input_set(uint8_t channel,
                                                     nrf_saadc_input_t pselp)
{
    NRF_SAADC->CH[channel].PSELP = pselp;
}


/**
    @brief Function for setting the SAADC channel monitoring limits.

    @param[in] channel Channel number.
    @param[in] low     Low limit.
    @param[in] high    High limit.
*/
__STATIC_INLINE void nrf_saadc_channel_limits_set(uint8_t channel, int16_t low, int16_t high)
{
    NRF_SAADC->CH[channel].LIMIT = (
                                       (((uint32_t) low << SAADC_CH_LIMIT_LOW_Pos) & SAADC_CH_LIMIT_LOW_Msk)
                                       | (((uint32_t) high << SAADC_CH_LIMIT_HIGH_Pos) & SAADC_CH_LIMIT_HIGH_Msk));
}


/**
    @brief Function for enabling specified SAADC interrupts.

    @param[in] saadc_int_mask Interrupt(s) to enable.
*/
__STATIC_INLINE void nrf_saadc_int_enable(uint32_t saadc_int_mask)
{
    NRF_SAADC->INTENSET = saadc_int_mask;
}


/**
    @brief Function for retrieving the state of specified SAADC interrupts.

    @param[in] saadc_int_mask Interrupt(s) to check.

    @retval true  If all specified interrupts are enabled.
    @retval false If at least one of the given interrupts is not enabled.
*/
__STATIC_INLINE bool nrf_saadc_int_enable_check(uint32_t saadc_int_mask)
{
    return (bool)(NRF_SAADC->INTENSET & saadc_int_mask);
}


/**
    @brief Function for disabling specified interrupts.

    @param saadc_int_mask Interrupt(s) to disable.
*/
__STATIC_INLINE void nrf_saadc_int_disable(uint32_t saadc_int_mask)
{
    NRF_SAADC->INTENCLR = saadc_int_mask;
}


/**
    @brief Function for generating masks for SAADC channel limit interrupts.

    @param[in] channel    SAADC channel number.
    @param[in] limit_type Limit type.

    @returns Interrupt mask.
*/
__STATIC_INLINE uint32_t nrf_saadc_limit_int_get(uint8_t channel, nrf_saadc_limit_t limit_type)
{
    NRFX_ASSERT(channel < NRF_SAADC_CHANNEL_COUNT);
    uint32_t mask = (limit_type == NRF_SAADC_LIMIT_LOW) ? NRF_SAADC_INT_CH0LIMITL : NRF_SAADC_INT_CH0LIMITH;
    return mask << (channel * 2);
}


/**
    @brief Function for checking whether the SAADC is busy.

    This function checks whether the analog-to-digital converter is busy with a conversion.

    @retval true  If the SAADC is busy.
    @retval false If the SAADC is not busy.
*/
__STATIC_INLINE bool nrf_saadc_busy_check(void)
{
    //return ((NRF_SAADC->STATUS & SAADC_STATUS_STATUS_Msk) == SAADC_STATUS_STATUS_Msk);
    //simplified for performance
    return NRF_SAADC->STATUS;
}


/**
    @brief Function for enabling the SAADC.

    The analog-to-digital converter must be enabled before use.
*/
__STATIC_INLINE void nrf_saadc_enable(void)
{
    NRF_SAADC->ENABLE = (SAADC_ENABLE_ENABLE_Enabled << SAADC_ENABLE_ENABLE_Pos);
}


/**
    @brief Function for disabling the SAADC.
*/
__STATIC_INLINE void nrf_saadc_disable(void)
{
    NRF_SAADC->ENABLE = (SAADC_ENABLE_ENABLE_Disabled << SAADC_ENABLE_ENABLE_Pos);
}


/**
    @brief Function for checking if the SAADC is enabled.

    @retval true  If the SAADC is enabled.
    @retval false If the SAADC is not enabled.
*/
__STATIC_INLINE bool nrf_saadc_enable_check(void)
{
    //simplified for performance
    return NRF_SAADC->ENABLE;
}


/**
    @brief Function for initializing the SAADC result buffer.

    @param[in] p_buffer Pointer to the result buffer.
    @param[in] size     Size of the buffer (in 16-bit samples).
*/
__STATIC_INLINE void nrf_saadc_buffer_init(nrf_saadc_value_t *p_buffer,
                                           uint32_t            size)
{
    NRF_SAADC->RESULT.PTR = (uint32_t)p_buffer;
    NRF_SAADC->RESULT.MAXCNT = size;
}


/**
    @brief Function for setting the SAADC result buffer pointer.

    @param[in] p_buffer Pointer to the result buffer.
*/
__STATIC_INLINE void nrf_saadc_buffer_pointer_set(nrf_saadc_value_t *p_buffer)
{
    NRF_SAADC->RESULT.PTR = (uint32_t)p_buffer;
}


/**
    @brief Function for getting the SAADC result buffer pointer.

    @return Pointer to the result buffer.
*/
__STATIC_INLINE nrf_saadc_value_t *nrf_saadc_buffer_pointer_get(void)
{
    return (nrf_saadc_value_t *)NRF_SAADC->RESULT.PTR;
}


/**
    @brief Function for getting the number of samples written to the result
          buffer since the previous START task.

    @returns Number of 16-bit samples written to the buffer.
*/
__STATIC_INLINE uint16_t nrf_saadc_amount_get(void)
{
    return NRF_SAADC->RESULT.AMOUNT;
}


/**
    @brief Function for setting the SAADC sample resolution.

    @param[in] resolution Bit resolution.
*/
__STATIC_INLINE void nrf_saadc_resolution_set(nrf_saadc_resolution_t resolution)
{
    NRF_SAADC->RESOLUTION = resolution;
}


/**
    @brief Function for configuring the oversampling feature.

